<?php

namespace Database\Seeders;

use App\Models\Book;
use App\Models\User;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void

    {
        $user_id = User::inRandomOrder()->first()->id;
        Book::create([
            "title"=> "الروح والجسد",
            "auther"=> "مصطفى محمود",
            "description"=> "الروح والجسد.. طرفان نقيضان يتصارعان وبينهما يعيش الإنسان في كبد تحلق به الروح في علياء المعاني السامية ويقيده الجسد الفاني باغلال محكمة من شهوات ورغبات.. هذا الصراع الذي تكلم فيه رجال الدين والفلاسفة والمفكرون والمتصوفون.. وحسمه لصالح الروح االأنبياء ومن خطا على نهجهم، ولكن ما ذا نعرف عن هذا الصراع ودواخله؟.. قد يكون الكثير و قد يكون أقل القليل، ولكننا حينما نقرأ ما كتب ا الروح والجسد..",
            "publish_year"=> "2005",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/1.webp",
            "file_path"=> "books_file/1.webp",
            "user_id" => $user_id,

        ]);
        Book::create([
            "title"=> "الروح والجسد",
            "auther"=> "مصطفى محمود",
            "description"=> "الروح والجسد.. طرفان نقيضان يتصارعان وبينهما يعيش الإنسان في كبد تحلق به الروح في علياء المعاني السامية ويقيده الجسد الفاني باغلال محكمة من شهوات ورغبات.. هذا الصراع الذي تكلم فيه رجال الدين والفلاسفة والمفكرون والمتصوفون.. وحسمه لصالح الروح االأنبياء ومن خطا على نهجهم، ولكن ما ذا نعرف عن هذا الصراع ودواخله؟.. قد يكون الكثير و قد يكون أقل القليل، ولكننا حينما نقرأ ما كتب ا الروح والجسد..",
            "publish_year"=> "2005",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/2.webp",
            "file_path"=> "books_file/2.webp",
            "user_id" => $user_id,


        ]);
        Book::create([
            "title"=> "الروح والجسد",
            "auther"=> "مصطفى محمود",
            "description"=> "الروح والجسد.. طرفان نقيضان يتصارعان وبينهما يعيش الإنسان في كبد تحلق به الروح في علياء المعاني السامية ويقيده الجسد الفاني باغلال محكمة من شهوات ورغبات.. هذا الصراع الذي تكلم فيه رجال الدين والفلاسفة والمفكرون والمتصوفون.. وحسمه لصالح الروح االأنبياء ومن خطا على نهجهم، ولكن ما ذا نعرف عن هذا الصراع ودواخله؟.. قد يكون الكثير و قد يكون أقل القليل، ولكننا حينما نقرأ ما كتب ا الروح والجسد..",
            "publish_year"=> "2005",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/3.webp",
            "file_path"=> "books_file/3.webp",
            "user_id" => $user_id,


        ]);
        Book::create([
            "title"=> "الروح والجسد",
            "auther"=> "مصطفى محمود",
            "description"=> "الروح والجسد.. طرفان نقيضان يتصارعان وبينهما يعيش الإنسان في كبد تحلق به الروح في علياء المعاني السامية ويقيده الجسد الفاني باغلال محكمة من شهوات ورغبات.. هذا الصراع الذي تكلم فيه رجال الدين والفلاسفة والمفكرون والمتصوفون.. وحسمه لصالح الروح االأنبياء ومن خطا على نهجهم، ولكن ما ذا نعرف عن هذا الصراع ودواخله؟.. قد يكون الكثير و قد يكون أقل القليل، ولكننا حينما نقرأ ما كتب ا الروح والجسد..",
            "publish_year"=> "2005",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/4.webp",
            "file_path"=> "books_file/4.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "القرآن كائن حى الكاتب د.مصطفى محمود",
            "auther"=> "مصطفى",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2005",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/5.webp",
            "file_path"=> "books_file/5.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/6.webp",
            "file_path"=> "books_file/6.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "القرأن الكريم",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/3.webp",
            "file_path"=> "books_file/3.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/5.webp",
            "file_path"=> "books_file/5.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/1.webp",
            "file_path"=> "books_file/1.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/6.webp",
            "file_path"=> "books_file/6.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/5.webp",
            "file_path"=> "books_file/5.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/4.webp",
            "file_path"=> "books_file/4.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/3.webp",
            "file_path"=> "books_file/3.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/5.webp",
            "file_path"=> "books_file/5.webp", 
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/5.webp",
            "file_path"=> "books_file/5.webp",
            "user_id"=> $user_id,

        ]);
        Book::create([
            "title"=> "الأدب العربي في العصر العباسي",
            "auther"=> "الدكتور ناظم رشيد",
            "description"=> "يقومُ الكتاب على قسمين كبيرين . الأول يتناول الأدب - شعرًا ونثرًا - من قيام الدولة العباسية سنة اثنتين وثلاثين ومائة للهجرة ، إلى سنة أربع وثلاثين وثلاث مائة للهجرة . والقسم الثاني ينتهي بانتهاء الدولة العباسية سنة ستّ وخمسين وستّ مائة للهجرة . ",
            "publish_year"=> "2020",
            "downloads"=> "5",
            "avatar_path"=> "books_avatar/6.webp",
            "file_path"=> "books_file/6.webp",
            "user_id"=> $user_id,

        ]);
        //
    }
}
